src/СРМ/src/Documents/ОтчетПоРаботам/ОтчетПоРаботам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоРаботам</name>
  <registerRecords>AccumulationRegister.ВысталенныеЗадачи</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыФормированияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.RA_RedmineЗадачи</types>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактОбращения</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Enums/RA_RedmineВидыСтатусовЗадач/RA_RedmineВидыСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RA_RedmineВидыСтатусовЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Решена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Enums/ВидыСтатусовЗадач/ВидыСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатусовЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ВариантыОформленияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Catalogs/ВидыОплатыЗадач/ВидыОплатыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОплатыЗадач</name>
  <predefined>
    <items>
      <name>Абонент</name>
      <description>Абонент</description>
    </items>
    <items>
      <name>Бесплатная</name>
      <description>Бесплатная</description>
    </items>
    <items>
      <name>Гарантия</name>
      <description>Гарантия</description>
    </items>
    <items>
      <name>Платная</name>
      <description>Платная</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/СРМ/src/Catalogs/RA_RedmineЗадачи/RA_RedmineЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RA_RedmineЗадачи</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.RA_RedmineПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Трекер</name>
    <type>
      <types>CatalogRef.RA_RedmineТрекеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.RA_RedmineСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.RA_RedmineПриоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.RA_RedmineКатегорииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StoryPoints</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/Documents/ОтчетПоРаботам/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗадачиНаСервере()
	Объект.Задачи.Очистить();
	
	ЗАпрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	RA_RedmineЗадачи.Ссылка КАК Задача,
	|	RA_RedmineЗадачи.Исполнитель.Пользователь КАК Исполнитель,
	|	RA_RedmineЗадачи.ОценкаТрудозатрат КАК КоличествоЧасов,
	|	ВЫБОР
	|		КОГДА RA_RedmineЗадачи.Статус.Платный
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОплатыЗадач.Платная)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыОплатыЗадач.Бесплатная)
	|	КОНЕЦ КАК ВидОплаты,
	|	RA_RedmineЗадачи.КонтактОбращения КАК КонтактОбращения
	|ПОМЕСТИТЬ ВыборкаЗадачОсновная
	|ИЗ
	|	Справочник.RA_RedmineЗадачи КАК RA_RedmineЗадачи
	|ГДЕ
	|	RA_RedmineЗадачи.Проект.Партнер = &Партнер
	|	И RA_RedmineЗадачи.Статус.Закрыто
	|	И RA_RedmineЗадачи.Статус.ВидСтатуса = &ВидСтатусаРедмайнаРешено
	|	И RA_RedmineЗадачи.ДатаЗакрытия >= &ДатаНачалаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Задача.Ссылка,
	|	Задача.Исполнитель,
	|	Задача.ОценкаТрудозатрат,
	|	Задача.ВидОплаты,
	|	Задача.КонтактОбращения
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	Задача.Проект.Партнер = &Партнер
	|	И Задача.Статус.Вид = &ВидСтатусаЗакрыт
	|	И Задача.ДатаЗакрытия >= &ДатаНачалаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаЗадачОсновная.Задача КАК Задача,
	|	ВыборкаЗадачОсновная.Исполнитель КАК Исполнитель,
	|	ВыборкаЗадачОсновная.КоличествоЧасов КАК КоличествоЧасов,
	|	ВыборкаЗадачОсновная.ВидОплаты КАК ВидОплаты,
	|	ВыборкаЗадачОсновная.КонтактОбращения КАК КонтактОбращения
	|ИЗ
	|	ВыборкаЗадачОсновная КАК ВыборкаЗадачОсновная
	|ГДЕ
	|	НЕ ВыборкаЗадачОсновная.Задача В
	|				(ВЫБРАТЬ
	|					ФормированиеЗаказаЗадачи.Задача КАК Задача
	|				ИЗ
	|					Документ.ОтчетПоРаботам.Задачи КАК ФормированиеЗаказаЗадачи
	|				ГДЕ
	|					ФормированиеЗаказаЗадачи.Ссылка.Проведен
	|					И ФормированиеЗаказаЗадачи.Ссылка <> &ТекущийДокумент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыборкаЗадачОсновная";
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("ДатаНачалаУчета", Константы.ДатаНачалаФормированияЗаказов.Получить());
	Запрос.УстановитьПараметр("ВидСтатусаРедмайнаРешено", Перечисления.RA_RedmineВидыСтатусовЗадач.Решена);
	Запрос.УстановитьПараметр("ТекущийДокумент",Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатусаЗакрыт",Перечисления.ВидыСтатусовЗадач.Закрыта);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() ЦИкл
		НС=Объект.Задачи.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗадачи(Команда)
	ЗаполнитьЗадачиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации=НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	Объект.ПериодРегистрации=ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
